In [64]:
import pandas as pd
import numpy as np

In [46]:
data = pd.DataFrame({'订单号':[1,1,2,2,3,4,5],'数量':[1,3,4,5,3,2,5],'商品名称':['汉堡','可乐','热狗','汉堡','冰淇淋','掉渣饼','全家桶'],'单价':['￥5','￥2','￥3','￥5','￥3','￥7','￥10']})

# 将data中的单价一列，修改为可计算的类型

In [4]:
data['单价'].apply(lambda x:int(x[1:]))

0     5
1     2
2     3
3     5
4     3
5     7
6    10
Name: 单价, dtype: int64

# 在数据data中订购最多商品的单价是多少？

In [47]:
a=data.groupby('商品名称').sum()

In [49]:
data[data.商品名称.isin([a.sort_values('数量',ascending=False).head(1).index[0]])].单价

0    ￥5
3    ￥5
Name: 单价, dtype: object

In [5]:
a=data.groupby('商品名称')

In [7]:
a.sum()

      订单号  数量
商品名称
全家桶     5   5
冰淇淋     3   3
可乐      1   3
掉渣饼     4   2
汉堡      3   6
热狗      2   4

In [10]:
x=a.sum().sort_values('数量',ascending = False).head(1)

In [12]:
x.index[0]

'汉堡'

In [16]:
data[data.商品名称.isin([x.index[0]])].单价

0    ￥5
3    ￥5
Name: 单价, dtype: object

In [17]:
data[data.商品名称.isin([a.sum().sort_values('数量',ascending = False).head(1).index[0]])].单价

0    ￥5
3    ￥5
Name: 单价, dtype: object

In [25]:
a=data.groupby('商品名称').sum()

In [29]:
data[data.商品名称.isin([a.sort_values('数量',ascending=False).head(1).index[0]])].单价

0    ￥5
3    ￥5
Name: 单价, dtype: object

# 在数据data中，那个订单花钱最多

In [56]:
data['整数单价']=data.单价.apply(lambda x:int(x[1:]))

In [59]:
data['总价']=data.数量*data.整数单价

In [60]:
data

   订单号  数量 商品名称   单价  整数单价  总价
0    1   1   汉堡   ￥5     5   5
1    1   3   可乐   ￥2     2   6
2    2   4   热狗   ￥3     3  12
3    2   5   汉堡   ￥5     5  25
4    3   3  冰淇淋   ￥3     3   9
5    4   2  掉渣饼   ￥7     7  14
6    5   5  全家桶  ￥10    10  50

In [61]:
data.groupby('订单号').sum().sort_values('总价',ascending=False).head(1)

     数量  整数单价  总价
订单号
5     5    10  50

In [30]:
data['整数单价']=data.单价.apply(lambda x:int(x[1:]))

In [31]:
data['总价']=data.数量*data.整数单价

In [35]:
data.groupby('订单号').sum().sort_values('总价',ascending=False).head(1)

     数量  整数单价  总价
订单号
5     5    10  50

# 在数据data中，如何求出一共卖出的商品数

In [37]:
data.数量.sum()

23

# 在数据data中，如何求一共有几种商品卖出

In [39]:
len(data.groupby('商品名称').sum())

6

In [40]:
data.商品名称.nunique()

6

In [43]:
pd.DataFrame({'A':['gsa'],'B':['嘎斯']})

     A   B
0  gsa  嘎斯

In [44]:
df = pd.DataFrame({'A':['1','2','3','4']})

In [45]:
df.reindex(['a','b','c','d'])

     A
a  NaN
b  NaN
c  NaN
d  NaN

In [62]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
订单号     7 non-null int64
数量      7 non-null int64
商品名称    7 non-null object
单价      7 non-null object
整数单价    7 non-null int64
总价      7 non-null int64
dtypes: int64(4), object(2)
memory usage: 416.0+ bytes

In [65]:
df = pd.DataFrame(np.arange(10,20).reshape(5,2))

# 请正确生成DataFrame，并索引出quantity等于1、item_name等于'Salsa'的数据

In [66]:
raw_data = {'order_id':[1,1,1,1,2,2,2,3,3,3,3],
'quantity':[1,1,1,2,2,3,2,1,2,1,2],
'item_name':['lzze','Salsa','Chicken','Tomato','Fresh','lzze','Chicken','lzze','Fresh','Tomato','Salsa'],'choice_description':[np.nan,'apple',np.nan,'Beans','Drinks','Cola','Sprite',np.nan,'Cola','Sprite','Drinks'],
'item_price':['$2.39','$3.39','$3.39','$2.39','$6.98','$4.69','$4.39','$5.39','$7.39','$6.39','$3.39']}

In [67]:
df=pd.DataFrame(raw_data)

In [69]:
df[(df.quantity == 1) & (df.item_name == 'Salsa')]

   order_id  quantity item_name choice_description item_price
1         1         1     Salsa              apple      $3.39

# 并索引出item_price大于$4的数据

In [71]:
df['price_num']=df['item_price'].apply(lambda x:float(x[1:]))

In [72]:
df[df.price_num > 4]

   order_id  quantity item_name choice_description item_price  price_num
4         2         2     Fresh             Drinks      $6.98       6.98
5         2         3      lzze               Cola      $4.69       4.69
6         2         2   Chicken             Sprite      $4.39       4.39
7         3         1      lzze                NaN      $5.39       5.39
8         3         2     Fresh               Cola      $7.39       7.39
9         3         1    Tomato             Sprite      $6.39       6.39

# 将df按B列分组取出C列的最大值并从小到大排序

In [73]:
df = pd.DataFrame({'A':['foo','bar','foo','bar','foo','bar','foo','foo'],
                   'B':['one','one','two','three','two','two','one','three'],
                   'C':np.random.randn(8),
                   'D':np.random.randn(8)})

In [76]:
df.groupby('B')['C'].max().sort_values()

B
two      0.092283
one      0.773722
three    0.868171
Name: C, dtype: float64

# 把df中columns名为'Year'列的数据类型转换成datetime64

In [77]:
df=pd.DataFrame({'Year':['1960','1961','1962','1963','1964'],
'Population':[179,182,185,188,191],'Total':[33,34,37,41,45],
'Violent':[28,28,30,31,36],'Property':[30,31,34,37,42],
'Murder':[9,8,8,8,9],'Forcible_Rape':[17,17,17,17,21],
'Robbery':[10,10,11,11,13]})

In [79]:
df.Year=pd.to_datetime(df.Year,format='%Y')

In [80]:
df

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery
0,1960-01-01,179,33,28,30,9,17,10
1,1961-01-01,182,34,28,31,8,17,10
2,1962-01-01,185,37,30,34,8,17,11
3,1963-01-01,188,41,31,37,8,17,11
4,1964-01-01,191,45,36,42,9,21,13

# 请将df的index的名字改为'Year'

In [81]:
df=pd.DataFrame({'Population':[179,182,185,188,191],'Total':[33,34,37,41,45],'Violent':[28,28,30,31,36],'Property':[30,31,34,37,42]},index = pd.date_range('1960',periods=5,freq='AS'))

In [83]:
df.index.name='Year'

In [84]:
df

            Population  Total  Violent  Property
Year
1960-01-01         179     33       28        30
1961-01-01         182     34       28        31
1962-01-01         185     37       30        34
1963-01-01         188     41       31        37
1964-01-01         191     45       36        42

In [99]:
df=pd.DataFrame({'Year':['1960','1961','1962','1963','1964'],
'Population':[179,182,185,188,191],'Total':[33,34,37,41,45],
'Violent':[28,28,30,31,36],'Property':[30,31,34,37,42]})

In [102]:
df = df.set_index('Year',drop=False)#drop=True

In [103]:
df

      Year  Population  Total  Violent  Property
Year
1960  1960         179     33       28        30
1961  1961         182     34       28        31
1962  1962         185     37       30        34
1963  1963         188     41       31        37
1964  1964         191     45       36        42

# 使用resample只获取"Population" 列最大值的正确选项是()

In [104]:
df=pd.DataFrame({'Population':[179,182,185,188,191],'Total':[33,34,37,41,45],'Violent':[28,28,30,31,36],'Property':[30,31,34,37,42]},index = pd.date_range('1960',periods=5,freq='AS'))

In [109]:
df['Population']

1960-01-01    179
1961-01-01    182
1962-01-01    185
1963-01-01    188
1964-01-01    191
Freq: AS-JAN, Name: Population, dtype: int64

In [110]:
df['Population'].resample('10AS').max()

1960-01-01    191.0
1970-01-01      NaN
Name: Population, dtype: float64

# 用date_range生成一个日期索引,命名为timerange，时间为2019年1月1日到2019年2月1日，设置为每十二小时计算一次

In [111]:
timerange = pd.date_range('2019-1-1','2019-2-1',freq='12H')